namespace bYteMe.Controllers
{
    using System.Collections.Generic;
    using System.Web.Mvc;

    public class AboutController : Controller
    {
        public ActionResult Index()
        {
            this.ViewBag.DescriptionText =
                "Ние сме отбор Rakija, състоящ се от трима студенти от Софтуерния Университет. Проекта ни е свързан с модула Software Technologies. Използваните езици и технологии са C#, ASP.NET, Entity Framework, HTML, CSS, JavaScript и SQL Server. Проекта представлява уеб разработка - сайт за запознанства между програмисти. Заедно със знанията ни от цялостното ни обучение в СофтУни и чувството ни за хумор, се опитахме да създадем нещо оригинално и забавно. Проекта ни, който се казва bYte me съдържа лог ин форма, форма за регистрация, след която може да имате достъп до страници като да видите собствения си профил, всички профили, създаване на публикации, публикации на всички потребители. Също така може да гласувате за даден профил дали го харесвате или не. В зависимост колко \"не-лайка\" сте получили, може да активирате различни \"утешителни награди\", зависещи от броя на \"не-лайковете\". Надяваме се проекта ни да ви хареса.";

            return this.View();
        }
    }
}