namespace bYteMe.Constants
{
    public class TextConstants
    {
        public const string SiteTitle = "bYte me";

        public const string SiteSubtitle = "сложете край на рекурсията в любовния ви живот";

        public const string AboutDescription = "Вие сте програмист, писнало ви е от кодене, имате нужда от малко топлина и нежност? "
                + "Хареса ли сте си мацка, но тя ви отказва и избира друг, който идея си няма от интегрални уравнения? "
                + "bYte me е правилното място за вас. Представяме ви най-новия проект, разработващ се от млади ентусиасти с цел по-добро и светло бъдеще в любовния живот на всеки програмист. "
                + "Докоснете се до най - новата технология в запознанствата между програмисти. За хората, които търсят душевен съпорт и редовно дебъгване. "
                + "Ние сме отбор Rakija, състоящ се от трима студенти от Софтуерния Университет. Проекта ни е свързан с модула Software Technologies. "
                + "Използваните езици и технологии са C#, ASP.NET, Entity Framework, HTML, CSS, JavaScript и SQL Server. "
                + "Проекта представлява уеб разработка - сайт за запознанства между програмисти. Заедно със знанията ни от цялостното ни обучение в СофтУни и чувството ни за хумор, "
                + "се опитахме да създадем нещо оригинално и забавно. Проекта ни, който се казва bYte me съдържа лог ин форма, форма за регистрация, след която може да имате достъп до страници като да видите собствения си профил,"
                + " всички профили, създаване на публикации, публикации на всички потребители. Също така може да гласувате за даден профил дали го харесвате или не. В зависимост колко \"не-лайка\" сте получили, може да активирате "
                + "различни \"утешителни награди\", зависещи от броя на \"не-лайковете\". Надяваме се проекта ни да ви хареса.";

        public static readonly string[] OrdersDescriptions = new[]
                                                                 {
                                                                     "Отказали са ти няколко пъти? Започни с първата поръчка - една бира. Не се колебай, а поръчай веднага утешителната си награда!",
                                                                     "Положението започва да става сериозно. Трябва ти по-стабилна утеха. Поръчай безплатната си каса бира и да не ти пука за всички, които са те зарязали.",
                                                                     "Е, всяко зло за добро, нали? Нищо, че не ти се получава в любовта. За сметка на това може да се насладиш на домашна отлежала сливова ракия и то безплатно! Та нали ти вече си плати със сълзи и отчаяние.",
                                                                     "Брат, работата няма да стане, видяло се е. Може би свалките не са за теб. Ти достигна до последното ниво на утешителните награди. Събери аверите и се почерпете. Друг вариант вече не ти остана."
                                                                 };
    }
}